//---------------------
// ch6_1.prj
// 作为 C++的console application工程,
// 不同的C++软件有不同的设置方法,
// 但其所组合的cpp代码文件是统一的
//---------------------
ch6_1.cpp
ch6_1_1.cpp
//---------------------


//---------------------
//    ch6_1.cpp
//---------------------
#include<iostream>
using namespace std;
//---------------------
void fn1();
void fn2();
int n;
//---------------------
int main(){
  n=3;
  fn1();         //fn1()函数的定义在本文件中
  cout<<n<<endl;
}//--------------------
void fn1(){
  fn2();         //fn2()函数的定义不在本文件中
}//--------------------
